src/Documents/Рассылка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Рассылка</Name>
			<Comment>Рассылка</Comment>
			<BasedOn>
				<xr:Item>Document.Рассылка</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Опрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ основание</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Рассылка</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтправителяSMS</Name>
					<Comment>Номер отправителя SMS</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Comment>Представление отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реклама</Name>
					<Comment>Реклама</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние рассылки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРассылок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Comment>Текст письма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Comment>Тема</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Comment>Учетная запись</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОДоставке</Name>
					<Comment>Уведомить о доставке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомитьОПрочтении</Name>
					<Comment>Уведомить о прочтении</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТекста</Name>
					<Comment>Формат текста</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Comment>Шаблон анкеты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сфпИдентификаторЗвонка</Name>
					<Comment>Идентификатор звонка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SMS</Name>
							<Comment>SMS</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Comment>Адрес</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Comment>Адрес электронной почты</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отказ</Name>
							<Comment>Отказ</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Comment>Получатель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление получателя сообщения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОбработкиЗвонка</Name>
							<Comment>Результат обработки звонка</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыОбработкиЗвонка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Comment>Событие</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.Событие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Comment>Телефон</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлектронноеПисьмо</Name>
							<Comment>Электронное письмо</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖалобаКлиента</Name>
							<Comment>Жалоба клиента</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЖалобаКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Звонок</Name>
							<Comment>Телефонный звонок</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/СообщениеSMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СообщениеSMS</Name>
			<BasedOn>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
				<xr:Item>Document.СообщениеSMS</xr:Item>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ЗапланированноеВзаимодействие</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокУчастников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументаСообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКогдаОтправить</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОтветственного</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адресаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКонтакта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КакСвязаться</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияСообщенияSMS</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Рассылка/Ext/ManagerModule.bsl
// Модуль менеджера документа "Рассылка"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура отправки электронной рассылки
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ЭлектроннаяРассылкаОтправить(Объект,ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.УчетнаяЗапись) Тогда
		ВывестиСообщение(НСтр("ru='Не указана учетная запись отправителя'"));
		Возврат;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Объект.Тема) Тогда
		ВывестиСообщение(НСтр("ru='Не указана тема письма'"));
		Возврат;
	КонецЕсли;
	
	// Создадим документы Электронное письмо исходящее
	Для Каждого Адресат Из Объект.Получатели  Цикл
		Если (НЕ Адресат.Отказ)И (ЗначениеЗаполнено(Адресат.Получатель)) И (ЗначениеЗаполнено(Адресат.АдресЭлектроннойПочты)) Тогда
			
			Если НЕ ЗначениеЗаполнено(Адресат.ЭлектронноеПисьмо) Тогда
				ЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
				ЭлектронноеПисьмо.Дата                     = ТекущаяДатаСеанса();
				ЭлектронноеПисьмо.УчетнаяЗапись            = Объект.УчетнаяЗапись;
				ЭлектронноеПисьмо.ОтправительПредставление = СокрЛП(Объект.ОтправительПредставление);
				ПисьмоПолучатель                           = ЭлектронноеПисьмо.ПолучателиПисьма.Добавить();
				ПисьмоПолучатель.Адрес                     = Адресат.АдресЭлектроннойПочты;
				ПисьмоПолучатель.Контакт                   = Адресат.Получатель;
				ПисьмоПолучатель.Представление             = Адресат.Получатель.Наименование;
				ЭлектронноеПисьмо.Тема                     = СокрЛП(Объект.Тема);
				ЭлектронноеПисьмо.СтатусПисьма             = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Черновик;
				Если Объект.ФорматТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
					ЭлектронноеПисьмо.ТекстHTML            = Объект.ТекстПисьма;
				Иначе
					ЭлектронноеПисьмо.Текст                = Объект.ТекстПисьма;
				КонецЕсли;
				ЭлектронноеПисьмо.ТипТекста                = Объект.ФорматТекста;
				ЭлектронноеПисьмо.УведомитьОДоставке       = Объект.УведомитьОДоставке;
				ЭлектронноеПисьмо.УведомитьОПрочтении      = Объект.УведомитьОПрочтении;
				Представление = ВзаимодействияКлиентСервер.ПолучитьПредставлениеАдресата(Строка(Адресат.Получатель), Адресат.АдресЭлектроннойПочты,"; ");
				ЭлектронноеПисьмо.СписокПолучателейПисьма  = Представление;
				ЭлектронноеПисьмо.ЕстьВложения             = ПрисоединенныеФайлыСлужебный.ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка).Количество()>0;
				Попытка
					ЭлектронноеПисьмо.Записать();
				Исключение
					Возврат;
				КонецПопытки;
				
				Адресат.ЭлектронноеПисьмо = ЭлектронноеПисьмо.Ссылка;
				// Скопируем присоединенные файлы
				Получатель = Адресат.ЭлектронноеПисьмо.ПолучитьОбъект();
				КопируемыеФайлы = ПрисоединенныеФайлыСлужебный.ПолучитьВсеПодчиненныеФайлы(Объект.Ссылка);
				Для Каждого КопируемыйФайл Из КопируемыеФайлы Цикл
					Если КопируемыйФайл.ПометкаУдаления Тогда
						Продолжить;
					КонецЕсли;
					ПрисоединенныйФайл = Справочники.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.СоздатьЭлемент();
					ЗаполнитьЗначенияСвойств(ПрисоединенныйФайл, КопируемыйФайл,,"Родитель,Владелец");
					КопияФайлаСсылка = Справочники.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.ПолучитьСсылку();
					ПрисоединенныйФайл.УстановитьСсылкуНового(КопияФайлаСсылка);
					ПрисоединенныйФайл.ВладелецФайла = Получатель.Ссылка;
					ПрисоединенныйФайл.Редактирует = Справочники.Пользователи.ПустаяСсылка();
					
					ПрисоединенныйФайл.ТекстХранилище = Новый ХранилищеЗначения(КопируемыйФайл.ТекстХранилище.Получить());
					ПрисоединенныйФайл.ФайлХранилище = Новый ХранилищеЗначения(КопируемыйФайл.ФайлХранилище.Получить());
					
					ПрисоединенныйФайл.ЭлектронныеПодписи.Очистить();
					Для Каждого КопируемаяСтрокаТаблицы Из КопируемыйФайл.ЭлектронныеПодписи Цикл
						КопияСтрокиТаблицы = ПрисоединенныйФайл.ЭлектронныеПодписи.Добавить();
						ЗаполнитьЗначенияСвойств(КопияСтрокиТаблицы, КопируемаяСтрокаТаблицы);
						КопияСтрокиТаблицы.Подпись = КопируемаяСтрокаТаблицы.Подпись;
						КопияСтрокиТаблицы.Сертификат = КопируемаяСтрокаТаблицы.Сертификат;
					КонецЦикла;
					
					ПрисоединенныйФайл.СертификатыШифрования.Очистить();
					Для Каждого КопируемаяСтрокаТаблицы Из КопируемыйФайл.СертификатыШифрования Цикл
						КопияСтрокиТаблицы = ПрисоединенныйФайл.СертификатыШифрования.Добавить();
						ЗаполнитьЗначенияСвойств(КопияСтрокиТаблицы, КопируемаяСтрокаТаблицы);
						КопияСтрокиТаблицы.Сертификат = КопируемаяСтрокаТаблицы.Сертификат;
					КонецЦикла;
					
					ДвоичныеДанные = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(КопируемыйФайл);
					ПрисоединенныйФайл.ТипХраненияФайла = ФайловыеФункцииСлужебный.ТипХраненияФайлов();
					Если ПрисоединенныйФайл.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
						ПрисоединенныеФайлыСлужебный.ЗаписатьФайлВИнформационнуюБазу(КопияФайлаСсылка, ДвоичныеДанные);
					Иначе
						СведенияОФайле = ФайловыеФункцииСлужебный.ДобавитьФайлВТом(ДвоичныеДанные, ПрисоединенныйФайл.ДатаМодификацииУниверсальная, Строка(ПрисоединенныйФайл.Наименование), ПрисоединенныйФайл.Расширение);
						ПрисоединенныйФайл.Том        = СведенияОФайле.Том;
						ПрисоединенныйФайл.ПутьКФайлу = СведенияОФайле.ПутьКФайлу;
					КонецЕсли;
					ПрисоединенныйФайл.Записать()
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		// Отправим электронное письмом
		Если (НЕ Адресат.Отказ) И (ЗначениеЗаполнено(Адресат.Получатель)) И ЗначениеЗаполнено(Адресат.ЭлектронноеПисьмо) И НЕ Адресат.ЭлектронноеПисьмо.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Отправлено Тогда
			Если ЭлектронноеПисьмо = Неопределено Тогда
				Письмо = Адресат.ЭлектронноеПисьмо.ПолучитьОбъект();
			Иначе
				Письмо = ЭлектронноеПисьмо;
			КонецЕсли;
			
			ИдентификаторПисьма = Взаимодействия.ВыполнитьОтправкуПисьма(Письмо);
			
			// Установим предмет письма
			СтруктураДляЗаписи = ВзаимодействияКлиентСервер.СтруктураРеквизитовВзаимодействияДляЗаписи(, Объект.Ссылка, Истина,);
			ВзаимодействияВызовСервера.ЗаписьРегистрРеквизитыВзаимодействия(Адресат.ЭлектронноеПисьмо, СтруктураДляЗаписи);
			
			Письмо.ИдентификаторСообщения = ИдентификаторПисьма;
			Письмо.СтатусПисьма    = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Отправлено;
			Письмо.ДатаОтправления = ТекущаяДатаСеанса();
			Письмо.Записать(РежимЗаписиДокумента.Запись);
			ВзаимодействияВызовСервера.УстановитьПапкуЭлектронногоПисьма(Адресат.ЭлектронноеПисьмо, Взаимодействия.ОпределитьПапкуДляПисьма(Адресат.ЭлектронноеПисьмо));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЭлектроннаяРассылкаОтправить()

// Процедура для отправления СМС-сообщения
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура РассылкаSMSОтправить(Объект,ПараметрыДействия=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.ТекстПисьма) Тогда
		ВывестиСообщение(НСтр("ru='Не указан текст сообщения.'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого Адресат Из Объект.Получатели  Цикл
		Если (НЕ Адресат.Отказ) И (ЗначениеЗаполнено(Адресат.Телефон)) И ЗначениеЗаполнено(Адресат.Получатель) И (НЕ ЗначениеЗаполнено(Адресат.SMS)) Тогда
			СообщениеSMS = Документы.СообщениеSMS.СоздатьДокумент();
			СообщениеSMS.Организация             = Объект.Организация;
			СообщениеSMS.ПодразделениеКомпании   = Объект.ПодразделениеКомпании; 
			СообщениеSMS.ВзаимодействиеОснование = Объект.Ссылка;
			СообщениеSMS.Состояние               = ПредопределенноеЗначение("Перечисление.СостоянияСообщенияSMS.Исходящее");
			СообщениеSMS.Дата                    = ТекущаяДатаСеанса();
			SMSПолучатель                        = СообщениеSMS.Адресаты.Добавить();
			SMSПолучатель.Контакт                = Адресат.Получатель;
			SMSПолучатель.ПредставлениеКонтакта  = Строка(Адресат.Получатель);
			SMSПолучатель.КакСвязаться           = Адресат.Телефон;
			SMSПолучатель.СостояниеСообщения     = ПредопределенноеЗначение("Перечисление.СостоянияСообщенияSMS.Исходящее");
			СообщениеSMS.ТекстСообщения          = Объект.ТекстПисьма;
			Взаимодействия.ОтправкаSMSПоДокументу(СообщениеSMS);
			Попытка
				СообщениеSMS.Записать();
			Исключение
				Возврат;
			КонецПопытки;
			Адресат.SMS = СообщениеSMS.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // РассылкаSMSОтправить()

// Получает КИ для массива контактов
//
//Параметры
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  ТипКИ   - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//
// Возвращаемое значение:
//   ТаблицаЗначений   - таблица содержащая контакты и адреса их электронной почты.
//
Процедура ОбновитьКИПользователя(Объект, ТипКИ) 
	
	Результат = Взаимодействия.ПолучитьАдресаЭлектроннойПочтыДляМассиваКонтактов(Объект.Получатели.Выгрузить().ВыгрузитьКолонку("Получатель"), ТипКИ);
	Для Каждого Строка Из Объект.Получатели Цикл
		Контакт = Результат.Найти(Строка.Получатель);
		Если НЕ Контакт = Неопределено Тогда
			Строка.СписокАдресов = Контакт.СписокАдресов;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ОбновитьКИПользователя()

// Получает наименование и адреса контактной информации
//
// Параметры
//  Контакт - Ссылка - контакт, для которого получаются данные
//  ТипКИ   - ПеречислениеСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//
// Возвращаемое значение:
//  Структура - содержит наименование контакта и список значений электронной почты контакта.
//
Функция ПолучитьНаименованиеИКИКонтакта(Контакт,ТипКИ)
	
	Если Не ЗначениеЗаполнено(Контакт) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Контакт.Метаданные().Иерархический Тогда
		Если Контакт.ЭтоГруппа Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ИмяТаблицы = Контакт.Метаданные().ПолноеИмя();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕстьNULL(ТаблицаКонтактнаяИнформация.Представление,"""") КАК КИ,
	|	Таблица.Наименование КАК Наименование
	|ИЗ
	|	" + ИмяТаблицы + " КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ " + ИмяТаблицы + ".КонтактнаяИнформация КАК ТаблицаКонтактнаяИнформация
	|		ПО (ТаблицаКонтактнаяИнформация.Ссылка = Таблица.Ссылка)
	|			И (ТаблицаКонтактнаяИнформация.Тип = &ТипКИ)
	|ГДЕ
	|	Таблица.Ссылка = &Контакт
	|ИТОГИ ПО
	|	Наименование";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Контакт", Контакт);
	Запрос.УстановитьПараметр("ТипКИ", ТипКИ);
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокКИ = Новый Структура("Наименование,КИ", Выборка.Наименование, Новый СписокЗначений);
	ВыборкаКИ = Выборка.Выбрать();
	Пока ВыборкаКИ.Следующий() Цикл
		СписокКИ.КИ.Добавить(ВыборкаКИ.КИ);
	КонецЦикла;
	
	Возврат СписокКИ;
	
КонецФункции //ПолучитьНаименованиеИКИКонтакта()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Получатели.Получатель");
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Тема");
	ОбязательныеРеквизиты.Добавить("Реклама");
	Если Объект.ХозОперация = Справочники.ХозОперации.ЭлектроннаяРассылка Тогда
		ОбязательныеРеквизиты.Добавить("УчетнаяЗапись");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	УникальныеПолучатели=Новый Массив();
	УникальныеПолучатели.Добавить("Получатель");
	УникальныеПолучатели.Добавить("АдресЭлектроннойПочты");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Получатели",УникальныеПолучатели);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Инициализируем параметры обработки действия с объектом
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Возвращаем сформированную структуру параметров
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Проект".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПроектПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПроектПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПроектПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	Если ПараметрыДействия.Свойство("ТипКИ") Тогда
		ОбновитьКИПользователя(Объект,ПараметрыДействия.ТипКИ);
	КонецЕсли;
	
КонецПроцедуры // ХозОперацияПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ПОЛУЧАТЕЛИ"

// Обработчик события возникающего при изменении данных реквизита "Получатель" в таблице "Получатели".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПолучателиПолучательПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ПараметрыДействия.Свойство("ТипКИ") Тогда
		КонтактИКИ = ПолучитьНаименованиеИКИКонтакта(Строка.Получатель,ПараметрыДействия.ТипКИ);
		Строка.СписокАдресов = "";
		Для Каждого ЭлементСписка Из КонтактИКИ.КИ Цикл
			Строка.СписокАдресов = Строка.СписокАдресов + ЭлементСписка.Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПолучателиПолучательПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		Неопределено,
		"ПечатьНаклеекИКонвертов",
		НСтр("ru = 'Печать наклеек и конвертов'"),
		СсылкаНаДокумент,
		"УправлениеПечатиЭтикетокИЦенниковКлиент.ПодготовкаПечатиНаклеекИКонвертов");
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ХозОперация", "ХозОперация");
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ЗаполнитьПоКонтрагентам", "Документ.Рассылка.Форма.ОтборКонтрагентов", ПараметрыФормы,, ИСТИНА);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ЗаполнитьПоКонтрагентам",, "Получатели", НСтр("ru = 'Заполнить с отбором по контрагентам'"), ПараметрыКоманды);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ПолучателиОчиститьСтрокиОтказ",, "Получатели", НСтр("ru = 'Очистить строки с признаком ""Отказ от рассылки""'"),,,,,Ложь);
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ОчиститьСтрокиБезКИ",, "Получатели", НСтр("ru = 'Очистить строки без контактной информации'"),,,,,Ложь);
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ПолучателиОчиститьСтрокиОтказ.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ПолучателиОчиститьСтрокиОтказ.Доступность", Истина);
	ПараметрыКоманд.Вставить("ОчиститьСтрокиБезКИ.Видимость",             Истина);
	ПараметрыКоманд.Вставить("ОчиститьСтрокиБезКИ.Доступность",           Истина);
	ПараметрыКоманд.Вставить("ЗаполнитьПоКонтрагентам.Видимость",         Истина);
	ПараметрыКоманд.Вставить("ЗаполнитьПоКонтрагентам.Доступность",       Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик очистки табличной части "Получатели" по отказу.
//
Функция ПолучателиОчиститьСтрокиОтказ(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
		Индекс = 0;
	Пока Индекс <= Объект.Получатели.Количество()-1 Цикл
		Если Объект.Получатели[Индекс]["Отказ"] Тогда
			Объект.Получатели.Удалить(Индекс);
			Продолжить;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецФункции // ПолучателиОчиститьСтрокиОтказ()

// Обработчик очистки табличной части "Получатели" по пустым полям контактной информации.
//
Функция ОчиститьСтрокиБезКИ(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЭлектроннаяРассылка") Тогда
		ИмяКолонки = "АдресЭлектроннойПочты";
	ИначеЕсли Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РассылкаSMS") ИЛИ Объект.ХозОперация =  ПредопределенноеЗначение("Справочник.ХозОперации.Телемаркетинг") Тогда
		ИмяКолонки = "Телефон";
	Иначе
		ИмяКолонки = "Адрес";
	КонецЕсли;
	
	Индекс = 0;
	
	Пока Индекс <= Объект.Получатели.Количество()-1 Цикл
		Если НЕ ЗначениеЗаполнено(Объект.Получатели[Индекс][ИмяКолонки]) Тогда
			Объект.Получатели.Удалить(Индекс);
			Продолжить;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецФункции // ОчиститьСтрокиБезКИ()

// Обработчик заполнения табличной части "Получатели" по реквизитам контрагентов.
//
Функция ЗаполнитьПоКонтрагентам(Объект, ПараметрыЗаполнения, ПараметрыДействия=Неопределено) Экспорт
	
	// Определим параметры
	КомпоновщикНастроек = ПараметрыЗаполнения.ЗаполнитьПоКонтрагентам.КомпоновщикНастроек;
	АдресСхемыКомпоновкиДанных = ПараметрыЗаполнения.ЗаполнитьПоКонтрагентам.АдресСхемыКомпоновкиДанных;
	ВидКонтактнойИнформации = ПараметрыЗаполнения.ЗаполнитьПоКонтрагентам.ВидКонтактнойИнформации;
	
	ПараметрыЗаполнения.ЗаполнитьПоКонтрагентам.Удалить("КомпоновщикНастроек");
	
	// Запрос к контрагентам и контактной информации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка,
	               |	КонтрагентыКонтактнаяИнформация.Представление
	               |ПОМЕСТИТЬ КИ
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Вид = &Вид
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Контрагенты.Ссылка КАК Получатель,
	               |	Контрагенты.ПометкаУдаления,
	               |	Контрагенты.ВидКонтрагента,
	               |	Контрагенты.ФормаСобственности,
	               |	Контрагенты.РекламныйИсточник,
	               |	Контрагенты.Пол,
	               |	Контрагенты.ДатаРождения,
	               |	КИ.Представление КАК ПредставлениеКонтактнойИнформации
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КИ КАК КИ
	               |		ПО Контрагенты.Ссылка = КИ.Ссылка
	               |ГДЕ
	               |	Контрагенты.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Вид", ВидКонтактнойИнформации);
	
	// Создадим макет компоновки
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакетаКомпоновкиДанных.Выполнить(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных), КомпоновщикНастроек.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	НаборДанных = Новый Структура("ТЗ", Запрос.Выполнить().Выгрузить());
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, НаборДанных);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	// Установим результирующую таблицу
	ТаблицаРезультат = Новый ТаблицаЗначений();
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	// В зависимости от вида контактной информации установим имя колонки
	Если ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента ИЛИ ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
		ТаблицаРезультат.Колонки.ПредставлениеКонтактнойИнформации.Имя = "Адрес";
	ИначеЕсли ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента Тогда
		ТаблицаРезультат.Колонки.ПредставлениеКонтактнойИнформации.Имя = "АдресЭлектроннойПочты";
	ИначеЕсли ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
		ТаблицаРезультат.Колонки.ПредставлениеКонтактнойИнформации.Имя = "Телефон";
	КонецЕсли;
	
	// Загрузим результат в табличную часть
	Объект.Получатели.Загрузить(ТаблицаРезультат);
	
КонецФункции // ЗаполнитьПоКонтрагентам()

#КонецЕсли
